evacomunaws/src/main/java/cr/ac/una/util/Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tns="http://controller.una.ac.cr/">
    <soapenv:Header />
    <soapenv:Body>
        <tns:createUser>
            <arg0>
                <email>darayaroma@gmail.com</email>
                <id>1</id>
                <identification>901140423</identification>
                <isActive>Y</isActive>
                <isAdmin>N</isAdmin>
                <landlineNumber>86420240</landlineNumber>
                <lastname>Araya</lastname>
                <name>Daniel</name>
                <password>arayaroma</password>
                <phoneNumber>86420240</phoneNumber>
                <profilePhoto>BASE64_ENCODED_DATA</profilePhoto>
                <secondLastname>Roman</secondLastname>
                <userPositionId>1</userPositionId>
                <username>arayaroma</username>
                <evaluatorId>1</evaluatorId>
                <evaluatedId>1</evaluatedId>
                <activationCode>90</activationCode>

            </arg0>
        </tns:createUser>
    </soapenv:Body>
</soapenv:Envelope>

<!--Get user by Id-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://controller.una.ac.cr/">
<soapenv:Header/>
<soapenv:Body>
    <con:getUserById>
        <!--Optional:-->
        <arg0>?</arg0>
    </con:getUserById>
</soapenv:Body>
</soapenv:Envelope>


<!--Company Request-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://controller.una.ac.cr/">
   <soapenv:Header/>
   <soapenv:Body>
      <con:createCompany>
         <!--Optional:-->
         <arg0>
            <!--Optional:-->
            <email>estebannajera42@gmail.com</email>
            <!--Optional:-->
            <name>EstebanCompany</name>
            <!--Optional:-->
            <photo>cid:671038741862</photo>
         </arg0>
      </con:createCompany>
   </soapenv:Body>
</soapenv:Envelope>